Repository: dbrgn/passwortpranger
Catalog: pranger/locale/*/LC_MESSAGES/django.po
Languages: de_ch

source: Submit Website
de_ch: Seite Melden

source: With this form you can submit websites where you suspect that they don't handle passwords safely. Our team will then review them and add them to this catalog, if appropriate.
de_ch: Hier kannst du Websites melden, von denen du den Verdacht hast, dass sie unsicher oder verantwortungslos mit Passwörtern umgehen. Wir werden diese dann prüfen und in unseren Katalog aufnehmen, falls sinnvoll.

# Headline, capitalize all words
source: Submission Sent
de_ch: Meldung Abgeschickt

source: Thanks for your submission! It will be published after it has been reviewed by our team.
de_ch: Vielen Dank für deine Meldung! Unser Team wird diese prüfen und gegebenenfalls in unseren Katalog aufnehmen.

source: Back to our <a href="/">home page</a>...
de_ch: Zurück zu unserer <a href="/">Startseite</a>...

source: Positive score
de_ch: Positive Punkte

source: Maximum positive score is 6 points
de_ch: Die maximale positive Punktzahl ist 6 Punkte

source: Base points
de_ch: Basispunkte

# base points
source: Base points are used for calculation.
de_ch: Basispunkte werden für die Berechnung verwendet

# TLS Link
source: A %(link)s connection is enforced through the whole website.
de_ch: Die gesamte Website ist mittels %(link)s verschlüsselt.

source: Thanks to an encrypted connection, all data is being transmitted securely through the network.
de_ch: Dadurch dass die Verbindung zu dieser Website verschlüsselt ist, werden alle Daten sicher übermittelt.

source: Two Factor Authentication is available
de_ch: Zwei-Faktor-Authentisierung ist verfügbar

source: The authenticating user has two challenges to complete. Usually he has to know something (password) and has to have something (i.e. access to a mobile phone to receive an SMS). The security improvement is significant.
de_ch: Der Benutzer muss sich mit zwei Faktoren authentisieren. Dies ist in den meisten Fällen ein Faktor den er weiss (ein Paswort) sowie etwas was er besitzt (SMS Code aufs Mobiltelefon). Der Sicherheitsgewinn dadurch ist erheblich.

source: The password strength is indicated visually
de_ch: Die Passwortstärke wird grafisch dargestellt.

source: Displaying the password strength encourages the user to chose a more safe password.
de_ch: Dadurch dass die Passwortstärke visuell dargestellt wird, wird der Benutzer dazu motiviert, ein sichereres Passwort zu verwenden.

source: The password length is unlimited.
de_ch: Die Passwortlänge wird nicht limitiert.

source: There is no reason to limit the length of a password. On the contrary, it can be an indication that the passwords are stored insecurely. Here's a good post about this topic: <a href="%(url)s">blog.knut.me</a> (German only).
de_ch: Es gibt keinen Grund dafür, die Passwortlänge auf einer Website zu limitieren. Im Gegenteil, es kann ein Hinweis darauf sein dass die Passwörter unsicher gespeichert werden. Hier ist ein guter Text zu diesen Thema: <a href="%(url)s">blog.knut.me</a>.

source: Negative score
de_ch: Negative Punkte

source: Maximum negative score is 6 points. The final value can't be negative.
de_ch: Die maximale Negativpunktzahl beträgt 6. Die berechnete Gesamtpunktzahl kann nicht negativ werden.

source: The password length is limited to 16 chars.
de_ch: Die Passwortlänge ist auf 16 Zeichen beschränkt.

source: The password length is limited to 10 chars.
de_ch: Die Passwortlänge ist auf 10 Zeichen limitiert.

source: Passwords of this length are too short and can be cracked with today's hardware in a reasonable amount of time. Furthermore, this limitation can be be an indication that the passwords are stored insecurely. Here's a good post about this topic: <a href="%(url)s">blog.knut.me</a> (German only).
de_ch: Passwörter von dieser Länge sind zu kurz und können mit heutiger Hardware in relativ kurzer Zeit geknackt werden. Desweiteren kann diese Limitierung ein Hinweis darauf sein, dass die Passwörter unsicher gespeichert werden. Hier ist ein guter Text zu diesen Thema: <a href="%(url)s">blog.knut.me</a>.

source: The characters useable for a password are limited.
de_ch: Die Zeichen, die für ein Passwort verwendet werden können sind eingeschränkt.

source: The prohibition of exotic symbols in password results in a lower count of different possible passwords.
de_ch: Dadurch, dass exotische Zeichen unterbunden werden, stehen weniger verschieden Passwort variationen zur Verfügung.

source: The password is delivered by email during the registration process.
de_ch: Das Passwort wird während der Registrierung im Klartext an den Benutzer übermittelt.

source: Emails are usually delivered in plain text. You should always expect that someone is reading your emails.
de_ch: Emails werden üblicherweise im Klartext übermittelt. Du solltest immer damit rechnen, dass deine Emails mitgelesen werden!

source: A changed password is delivered by email
de_ch: Ein geändertes Passwort wird im Klartext per Email übermittelt.

source: A forgotten password is delivered by email
de_ch: Ein vergessenes Passwort wird im Klartext per Email übermittelt.

source: In order to send a password in plain text, the website operator has to save it in plain text. This could not only result in data theft by third parties, even the website administraor could abuse it.
de_ch: Damit man sich das Passwort im Klartext zusenden lassen kann, muss die Webseite das Passwort ungesichtert abspeichern. Das könnte nicht nur in falsche Hände gelanden, sondern auch von Adminstratoren missbraucht werden.

# TLS Link
source: A %(link)s connection is not possible on this website.
de_ch: Es ist keine %(link)s Verschlüsselung implementiert.

source: The password transmitted in plain text an could be intercepted.
de_ch: Das Passwort wird beim Login im Klartext übertragen und kann abgefangen werden.

source: Some pages are transmitted unsecured.
de_ch: Einige Seiten werden verschlüsselt übermittelt.

source: The password can most likely not be intercepted, but the user account could be stolen.
de_ch: Das Passwort kann zwar nicht abgefangen werden, aber das Benutzerkonto kann einfach übernommen werden.

# TLS Link
source: All pages are available through %(link)s, but the user is not redirected automatically.
de_ch: Alle Seiten stehen in %(link)s zur Verfügung, allerdings wird Benutzer nicht automatisch weitergeleitet.

source: The user is responsible for his safety.
de_ch: Der Benutzer ist somit für seine Sicherheit selbst verantwortlich.

source: Total Score
de_ch: Gesamtpunktzahl

# total points
source: The total score of %(sitename)s is
de_ch: Die Gesamtpunktzahl von %(sitename)s ist
